#+title: About Dynamic Adding to Classpath in Clojure
#+CATEGORY: Coding
#+ORGX: true
#+PUBLISHED_DATE: <2026-01-25 Sun>


Well, I guess people will just inevitably get into the problem of ~classpath~, one way or another. [[https://lambdaisland.com/blog/2021-08-25-classpath-is-a-lie][The Classpath is a Lie]] described the problem very well: /classpath is a lie/. ~classpath~, /per se/, is a simple list separated by colons, however, the real work is done by the ~Classloader~.

Nevertheless, this isn't a post talking about ~classpath~ and ~ClassLoader~. There are already a lot of great articles talking about it ([[#links][links]] at the end of this post), and I can't claim I understand ~ClassLoaders~ to the extent that I can confidently teach others about it either.

This is a blog about what I have found during the process of trying to add new directories to ~classpath~ and ~require~ Clojure files in them at runtime. ~ClassLoader~ in Clojure is something very messy. The best strategy probably is to avoid the problem altogether. But still, if you really want to do it, I wish the following content can offer some help.

* Use Builtin ~clojure.core/add-classpath~

~Clojure~ has a builtin ~add-classpath~ function. Although it has been deprecated, it works for simple use cases.

#+BEGIN_SRC emacs-lisp :exports none
  (setq-local cider-buffer-ns 'demo)
  (setq-local org-babel-clojure-backend 'cider)
#+END_SRC

#+RESULTS:
: cider

#+BEGIN_SRC clojure :exports none
(ns demo
    (:require [clojure.java.io :as io])
    (:import (java.nio.file Files Path)
             (java.io File)
             (java.net URI)))
#+END_SRC

#+RESULTS:
: nil


#+BEGIN_SRC clojure :results output
  (defn check-dynamic-load []
    (let [tmp-dir (.toFile (Files/createTempDirectory "classpath-demo" (into-array java.nio.file.attribute.FileAttribute [])))
          tmp-clj (File/createTempFile "demo" ".clj" tmp-dir)
          tmp-name (subs (.getName tmp-clj)
                         0
                         (.lastIndexOf (.getName tmp-clj)
                                       "."))]
      ;; Add `tmp-dir` to `classpath` using builtin `add-classpath`.
      (add-classpath (.toURL tmp-dir))

      ;; Put a Clojure file under the directory
      (spit tmp-clj
            (str "(ns " tmp-name ") (def a 1)"))
                                          ;
      ;; `require` the Clojure file, and resolve the variable
      (assert (= 1 (var-get (requiring-resolve (symbol tmp-name
                                                       "a")))))

      ;; Update the Clojure file
      (spit tmp-clj
            (str "(ns " tmp-name ") (def a 2)"))

      ;; Reload the Clojure file
      (require (symbol tmp-name)
               :reload-all)

      ;; We can read the new value
      (assert (= 2 (var-get (requiring-resolve (symbol tmp-name
                                                       "a")))))
      (println "success")))

  ;; success
  (check-dynamic-load)
#+END_SRC

#+RESULTS:
: WARNING: add-classpath is deprecated
: success

If we evaluate the above code in a REPL or in cider, it works and prints "success". As we can see from the code, we can ~require~ a Clojure file whose path determined at runtime, and reload it to get the updated value.

However, there is a reason of it being deprecated. We can check its source code:

#+BEGIN_SRC java
  // The method used by clojure.core/add-classpath
  static public void addURL(Object url) throws MalformedURLException{
        URL u = (url instanceof String) ? toUrl((String) url) : (URL) url;
        ClassLoader ccl = Thread.currentThread().getContextClassLoader();
        if(ccl instanceof DynamicClassLoader)
                ((DynamicClassLoader)ccl).addURL(u);
        else
                throw new IllegalAccessError("Context classloader is not a DynamicClassLoader");
  }
#+END_SRC

It checks if the current thread's ~ContextClassLoader~ is a ~DynamicClassLoader~. If so, it will call the ~DynamicClassLoader~'s ~addURL~ method.
That means, this method will fail if there's some code set the current ~ContextClassLoader~ to something other than a ~DynamicClassLoader~.

#+begin_orgx_note
We expect ~add-classpath~ continues to work in case because the convention of setting a new ~ClassLoader~ is to set the current ~ClassLoader~ as the parent of the newly created ~ClassLoader~. However, ~clojure.core/add-classpath~ only checks the current ~ClassLoader~, more on this in the section.
#+end_orgx_note

#+BEGIN_SRC clojure :results output
  (let [future
        (future
          (let [cl (.getContextClassLoader (Thread/currentThread))]
            (.setContextClassLoader (Thread/currentThread)
                                    (java.net.URLClassLoader. (into-array java.net.URL [])
                                                              cl)))
  	    (try (check-dynamic-load)
               (assert "unreachable")
               (catch Throwable t
                 (println "dynamic loading failed"))))]
    ;; "dynamic loading failed"
    @future)
#+END_SRC

#+RESULTS:
: WARNING: add-classpath is deprecated
: dynamic loading failed


